ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/msp/mspm33c321x/SPGSS2_1.0.xml
        <register id="SPGSS2_PINCM_U3_RTS" width="32" offset="0x38" description="P0">
            <bitfield id="PSTATE" description="Peripheral-Analog Channel State" begin="7" end="6" width="2" rwaccess="R/W">
                <bitenum id="UNASSIGNED" value="0x0" description="P-Channel is in Unassigned State"/>
                <bitenum id="HANDOVER" value="0x1" description="P-Channel is in Handover State"/>
                <bitenum id="CONC_NOT_LOCKED" value="0x2" description="P-Channel is in Connected State and not Locked (That is F field is allowed to change without going back through Unassigned state)"/>
                <bitenum id="CONC_LOCKED" value="0x3" description="P-Channel is in Connected State and Locked (That is F field is not allowed to change to a different non-Zero value until both G and P channels go to Unassigned)"/>
            </bitfield>
            <bitfield id="GSTATE" description="GPIO Channel State" begin="15" end="14" width="2" rwaccess="R/W">
                <bitenum id="UNASSIGNED" value="0x0" description="G-Channel is in Unassigned State"/>
                <bitenum id="HANDOVER" value="0x1" description="G-Channel is in Handover State"/>
                <bitenum id="CONC_NOT_LOCKED" value="0x2" description="G-Channel is in Connected State and not Locked (That is F field is allowed to change without going back through Unassigned state)"/>
                <bitenum id="CONC_LOCKED" value="0x3" description="G-Channel is in Connected State and Locked (That is F field is not allowed to change to a different non-Zero value until both G and P channels go to Unassigned)"/>
            </bitfield>
            <bitfield id="PIPD" description="Pull down enable" begin="16" end="16" width="1" rwaccess="R/W">
                <bitenum id="NO_PULL_DOWN" value="0x0" description="No pull down"/>
                <bitenum id="PULL_DOWN" value="0x1" description="Pull down"/>
            </bitfield>
            <bitfield id="PIPU" description="Pull up enable" begin="17" end="17" width="1" rwaccess="R/W">
                <bitenum id="NO_PULL_UP" value="0x0" description="No pull up"/>
                <bitenum id="PULL_UP" value="0x1" description="Pull up"/>
            </bitfield>
            <bitfield id="INENA" description="Input enable" begin="18" end="18" width="1" rwaccess="R/W">
                <bitenum id="INP_DISABLE" value="0x0" description="Inputs 0 to connected core"/>
                <bitenum id="INP_ENABLE" value="0x1" description="Inputs IO pad value to connected core"/>
            </bitfield>
            <bitfield id="HYSTEN" description="Hysteresis enable" begin="19" end="19" width="1" rwaccess="R/W">
                <bitenum id="DIS_HYST" value="0x0" description="No hysteresis"/>
                <bitenum id="EN_HYST" value="0x1" description="Hysteresis on"/>
            </bitfield>
            <bitfield id="INV" description="Invert digital input/output relative to peripheral/GPIO" begin="26" end="26" width="1" rwaccess="R/W">
                <bitenum id="NO_CHNG" value="0x0" description="Input and output are non-inverted"/>
                <bitenum id="CHNG" value="0x1" description="Input and output are inverted"/>
            </bitfield>
            <bitfield id="WUEN" description="Wake up enable" begin="27" end="27" width="1" rwaccess="R/W">
                <bitenum id="NO_WAKEUP" value="0x0" description="Wake up not enabled"/>
                <bitenum id="WAKEUP" value="0x1" description="Wake up enabled"/>
            </bitfield>
            <bitfield id="WCOMP" description="Wake up compare value" begin="28" end="28" width="1" rwaccess="R/W">
                <bitenum id="MATCH_ZERO" value="0x0" description="Match 0 will wake"/>
                <bitenum id="MATCH_ONE" value="0x1" description="Match 1 will wake"/>
            </bitfield>
            <bitfield id="GFLT" description="Glitch Filter Enable" begin="30" end="30" width="1" rwaccess="R/W">
                <bitenum id="DISABLE" value="0x0" description="No internal glitch filter"/>
                <bitenum id="ENABLE" value="0x1" description="Use internal glitch filter"/>
            </bitfield>
        </register>
        <register id="SPGSS2_PINCM_U3_CTS" width="32" offset="0x3C" description="P0">
            <bitfield id="PSTATE" description="Peripheral-Analog Channel State" begin="7" end="6" width="2" rwaccess="R/W">
                <bitenum id="UNASSIGNED" value="0x0" description="P-Channel is in Unassigned State"/>
                <bitenum id="HANDOVER" value="0x1" description="P-Channel is in Handover State"/>
                <bitenum id="CONC_NOT_LOCKED" value="0x2" description="P-Channel is in Connected State and not Locked (That is F field is allowed to change without going back through Unassigned state)"/>
                <bitenum id="CONC_LOCKED" value="0x3" description="P-Channel is in Connected State and Locked (That is F field is not allowed to change to a different non-Zero value until both G and P channels go to Unassigned)"/>
            </bitfield>
            <bitfield id="GSTATE" description="GPIO Channel State" begin="15" end="14" width="2" rwaccess="R/W">
                <bitenum id="UNASSIGNED" value="0x0" description="G-Channel is in Unassigned State"/>
                <bitenum id="HANDOVER" value="0x1" description="G-Channel is in Handover State"/>
                <bitenum id="CONC_NOT_LOCKED" value="0x2" description="G-Channel is in Connected State and not Locked (That is F field is allowed to change without going back through Unassigned state)"/>
                <bitenum id="CONC_LOCKED" value="0x3" description="G-Channel is in Connected State and Locked (That is F field is not allowed to change to a different non-Zero value until both G and P channels go to Unassigned)"/>
            </bitfield>
            <bitfield id="PIPD" description="Pull down enable" begin="16" end="16" width="1" rwaccess="R/W">
                <bitenum id="NO_PULL_DOWN" value="0x0" description="No pull down"/>
                <bitenum id="PULL_DOWN" value="0x1" description="Pull down"/>
            </bitfield>
            <bitfield id="PIPU" description="Pull up enable" begin="17" end="17" width="1" rwaccess="R/W">
                <bitenum id="NO_PULL_UP" value="0x0" description="No pull up"/>
                <bitenum id="PULL_UP" value="0x1" description="Pull up"/>
            </bitfield>
            <bitfield id="INENA" description="Input enable" begin="18" end="18" width="1" rwaccess="R/W">
                <bitenum id="INP_DISABLE" value="0x0" description="Inputs 0 to connected core"/>
                <bitenum id="INP_ENABLE" value="0x1" description="Inputs IO pad value to connected core"/>
            </bitfield>
            <bitfield id="HYSTEN" description="Hysteresis enable" begin="19" end="19" width="1" rwaccess="R/W">
                <bitenum id="DIS_HYST" value="0x0" description="No hysteresis"/>
                <bitenum id="EN_HYST" value="0x1" description="Hysteresis on"/>
            </bitfield>
            <bitfield id="INV" description="Invert digital input/output relative to peripheral/GPIO" begin="26" end="26" width="1" rwaccess="R/W">
                <bitenum id="NO_CHNG" value="0x0" description="Input and output are non-inverted"/>
                <bitenum id="CHNG" value="0x1" description="Input and output are inverted"/>
            </bitfield>
            <bitfield id="WUEN" description="Wake up enable" begin="27" end="27" width="1" rwaccess="R/W">
                <bitenum id="NO_WAKEUP" value="0x0" description="Wake up not enabled"/>
                <bitenum id="WAKEUP" value="0x1" description="Wake up enabled"/>
            </bitfield>
            <bitfield id="WCOMP" description="Wake up compare value" begin="28" end="28" width="1" rwaccess="R/W">
                <bitenum id="MATCH_ZERO" value="0x0" description="Match 0 will wake"/>
                <bitenum id="MATCH_ONE" value="0x1" description="Match 1 will wake"/>
            </bitfield>
            <bitfield id="GFLT" description="Glitch Filter Enable" begin="30" end="30" width="1" rwaccess="R/W">
                <bitenum id="DISABLE" value="0x0" description="No internal glitch filter"/>
                <bitenum id="ENABLE" value="0x1" description="Use internal glitch filter"/>
            </bitfield>
        </register>
