ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/msp/mspm33c321x/SPGSS2_1.0.xml
    <register id="SPGSS2_UC3_UART_IPSPECIFIC_LCRH" width="32" offset="0x7104" description="UART Line Control Register">
        <bitfield id="BRK" description="UART Send Break (for LIN Protocol)
1. Break condition is sent on the line for as long as this bit is set" begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Normal operation"/>
            <bitenum id="ENABLE" value="0x1" description="A low level is continually output on the UARTxTXD signal, after completing transmission of the current character. For the proper execution of the break command, software must set this bit for at least two frames (character periods)."/>
        </bitfield>
        <bitfield id="PEN" description="UART Parity Enable" begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Parity is disabled and no parity bit is added to the data frame."/>
            <bitenum id="ENABLE" value="0x1" description="Parity checking and generation is enabled."/>
        </bitfield>
        <bitfield id="EPS" description="UART Even Parity Select  This bit has no effect when parity is disabled by the PEN bit.  For 9-Bit UART Mode transmissions, this bit controls the address byte and data byte indication (9th bit). 0 = The transferred byte is a data byte 1 = The transferred byte is an address byte" begin="2" end="2" width="1" rwaccess="R/W">
            <bitenum id="ODD" value="0x0" description="Odd parity is performed, which checks for an odd number of 1s."/>
            <bitenum id="EVEN" value="0x1" description="Even parity generation and checking is performed during transmission and reception, which checks for an even number of 1s in data and parity bits."/>
        </bitfield>
        <bitfield id="STP2" description="UART Two Stop Bits Select     When in 7816 smart card mode (the SMART bit is set in the UARTCTL register), the number of stop bits is forced to 2." begin="3" end="3" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="One stop bit is transmitted at the end of a frame."/>
            <bitenum id="ENABLE" value="0x1" description="Two stop bits are transmitted at the end of a frame. The receive logic checks for two stop bits being received and provide Frame Error if either is invalid."/>
        </bitfield>
        <bitfield id="WLEN" description="UART Word Length  The bits indicate the number of data bits transmitted or received in a frame as follows:" begin="5" end="4" width="2" rwaccess="R/W">
            <bitenum id="DATABIT5" value="0x0" description="5 bits (default)"/>
            <bitenum id="DATABIT6" value="0x1" description="6 bits"/>
            <bitenum id="DATABIT7" value="0x2" description="7 bits"/>
            <bitenum id="DATABIT8" value="0x3" description="8 bits"/>
        </bitfield>
        <bitfield id="SPS" description="UART Stick Parity Select
The Stick Parity Select (SPS) bit is used to set either a permanent '1' or a permanent '0' as parity when transmitting or receiving data. Its purpose is to typically indicate the first byte of a package or to mark an address byte, for example in a multi-drop RS-485 network.
When bits PEN, EPS, and SPS of UARTLCRH are set, the parity bit is transmitted and checked as a 0. 
When bits PEN and SPS are set and EPS is cleared, the parity bit is transmitted and checked as a 1." begin="6" end="6" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Disable Stick Parity"/>
            <bitenum id="ENABLE" value="0x1" description="Enable Stick Parity"/>
        </bitfield>
        <bitfield id="SENDIDLE" description="UART send IDLE pattern. When this bit is set,  SENDIDLE period of 11 bit times will be sent on the TX line.  
Read STAT.SENDIDLE bit to readback current status of SENDIDLE" begin="7" end="7" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Normal operation"/>
            <bitenum id="ENABLE" value="0x1" description="Send Idle Pattern"/>
        </bitfield>
        <bitfield id="EXTDIR_SETUP" description="Defines the number of UARTclk ticks the signal to control the external driver for the RS485 will be set before the START bit is send" begin="20" end="16" width="5" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0x1F" description="Highest possible value"/>
        </bitfield>
        <bitfield id="EXTDIR_HOLD" description="Defines the number of UARTclk ticks the signal to control the external driver for the RS485 will be reset after the beginning of the stop bit. (If 2 STOP bits are enabled the beginning of the 2nd STOP bit.)" begin="25" end="21" width="5" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0x1F" description="Highest possible value"/>
        </bitfield>
        <bitfield id="SUSPEND" description="Suspend external communication" begin="26" end="26" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Functional mode resumed"/>
            <bitenum id="ENABLE" value="0x1" description="External communication suspended"/>
        </bitfield>
    </register>
    <register id="SPGSS2_UC3_UART_IPSPECIFIC_STAT" width="32" offset="0x7108" description="UART Status Register">
        <bitfield id="BUSY" description="UART Busy
			This bit is set as soon as the transmit FIFO/buffer becomes non-empty (regardless of whether UART is enabled) or if a receive data is currently ongoing (after the start edge have been detected until a complete byte, including all stop bits, has been received by the shift register).
In IDLE_Line mode the Busy signal also stays set during the idle time generation." begin="0" end="0" width="1" rwaccess="R">
            <bitenum id="CLEARED" value="0x0" description="The UART is not busy."/>
            <bitenum id="SET" value="0x1" description="The UART is busy transmitting data. This bit remains set until the complete byte, including all stop bits, has been sent/received from/into the shift register."/>
        </bitfield>
        <bitfield id="TXFF" description="UART Transmit FIFO Full  The meaning of this bit depends on the state of the FEN bit in the CTL0 register." begin="6" end="6" width="1" rwaccess="R">
            <bitenum id="CLEARED" value="0x0" description="The transmitter is not full."/>
            <bitenum id="SET" value="0x1" description="transmit FIFO is full."/>
        </bitfield>
        <bitfield id="RXFF" description="UART Receive FIFO Full" begin="3" end="3" width="1" rwaccess="R">
            <bitenum id="CLEARED" value="0x0" description="The receiver can receive data."/>
            <bitenum id="SET" value="0x1" description="receive FIFO is full."/>
        </bitfield>
        <bitfield id="TXFE" description="UART Transmit FIFO Empty" begin="5" end="5" width="1" rwaccess="R">
            <bitenum id="CLEARED" value="0x0" description="The transmitter has data to transmit."/>
            <bitenum id="SET" value="0x1" description="transmit FIFO is empty."/>
        </bitfield>
        <bitfield id="CTS" description="Clear To Send" begin="8" end="8" width="1" rwaccess="R">
            <bitenum id="CLEARED" value="0x0" description="The CTS signal is not asserted (high)."/>
            <bitenum id="SET" value="0x1" description="The CTS signal is asserted (low)."/>
        </bitfield>
        <bitfield id="IDLE" description="IDLE mode has been detected in Idleline-Multiprocessor-Mode.
The IDLE bit is used as an address tag for each block of characters. In idle-line multiprocessor format, this bit is set when a received character is an address." begin="9" end="9" width="1" rwaccess="R">
            <bitenum id="CLEARED" value="0x0" description="IDLE has not been detected before last received character.
(In idle-line multiprocessor mode)."/>
            <bitenum id="SET" value="0x1" description="IDLE has been detected before last received character.
(In idle-line multiprocessor mode)."/>
        </bitfield>
        <bitfield id="RXFE" description="UART Receive FIFO Empty" begin="2" end="2" width="1" rwaccess="R">
            <bitenum id="CLEARED" value="0x0" description="The receiver is not empty."/>
            <bitenum id="SET" value="0x1" description="eceive FIFO is empty."/>
        </bitfield>
        <bitfield id="RXCLR" description="RX FIFO Clear Status" begin="4" end="4" width="1" rwaccess="R">
            <bitenum id="CLEARED" value="0x0" description="FIFO is not cleared"/>
            <bitenum id="SET" value="0x1" description="FIFO clear is complete"/>
        </bitfield>
        <bitfield id="TXCLR" description="TX FIFO Clear Status" begin="7" end="7" width="1" rwaccess="R">
            <bitenum id="CLEARED" value="0x0" description="FIFO is not cleared"/>
            <bitenum id="SET" value="0x1" description="FIFO clear is complete"/>
        </bitfield>
        <bitfield id="SENDIDLE" description="TX FIFO Clear Status" begin="10" end="10" width="1" rwaccess="R">
            <bitenum id="CLEARED" value="0x0" description="IDLE condition has not yet been sent on the line"/>
            <bitenum id="SET" value="0x1" description="IDLE condition has been sent on the line"/>
        </bitfield>
    </register>
    <register id="SPGSS2_UC3_UART_IPSPECIFIC_IFLS" width="32" offset="0x710C" description="UART Interrupt FIFO Level Select Register">
        <bitfield id="TXIFLSEL" description="FIFO Level Select for generating events (interrupt/dma). 
Note: for undefined settings the default configuration is used." begin="2" end="0" width="3" rwaccess="R/W">
            <bitenum id="LVL_3_4" value="0x1" description="TX FIFO &lt;= 3/4 empty"/>
            <bitenum id="LVL_1_2" value="0x2" description="TX FIFO &lt;= 1/2 empty (default)"/>
            <bitenum id="LVL_1_4" value="0x3" description="TX FIFO &lt;= 1/4 empty"/>
            <bitenum id="LVL_NOT_FULL" value="0x4" description="Opposite of full"/>
            <bitenum id="LVL_EMPTY" value="0x5" description="TX FIFO is empty"/>
            <bitenum id="LVL_ALMOST_EMPTY" value="0x6" description="TX FIFO &lt;= 1"/>
            <bitenum id="LVL_ALMOST_FULL" value="0x7" description="TX_FIFO &gt;= (MAX_FIFO_LEN -1)"/>
        </bitfield>
        <bitfield id="RXIFLSEL" description="FIFO Level Select for generating events (interrupt/dma). 
Note: for undefined settings the default configuration is used." begin="6" end="4" width="3" rwaccess="R/W">
            <bitenum id="LVL_1_4" value="0x1" description="RX FIFO &gt;= 1/4 full"/>
            <bitenum id="LVL_1_2" value="0x2" description="RX FIFO &gt;= 1/2 full (default)"/>
            <bitenum id="LVL_3_4" value="0x3" description="RX FIFO &gt;= 3/4 full"/>
            <bitenum id="LVL_NOT_EMPTY" value="0x4" description="Opposite of empty"/>
            <bitenum id="LVL_FULL" value="0x5" description="RX FIFO is full"/>
            <bitenum id="LVL_ALMOST_FULL" value="0x6" description="RX_FIFO &gt;= (MAX_FIFO_LEN -1)"/>
            <bitenum id="LVL_ALMOST_EMPTY" value="0x7" description="RX_FIFO &lt;= 1"/>
        </bitfield>
        <bitfield id="RXTOSEL" description="UART Receive Interrupt Timeout Select. When receiving no start edge for an additional character within the set bittimes a RX interrupt is set even if the FIFO level is not reached. A value of 0 disables this function." begin="11" end="8" width="4" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0xF" description="Highest possible value"/>
        </bitfield>
        <bitfield id="TXCLR" description="TX FIFO CLEAR. Setting this bit will clear the TX FIFO contents." begin="3" end="3" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Disable FIFO clear"/>
            <bitenum id="ENABLE" value="0x1" description="Enable FIFO Clear"/>
        </bitfield>
        <bitfield id="RXCLR" description="RX FIFO CLEAR. Setting this bit will clear the RX FIFO contents." begin="7" end="7" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Disable FIFO clear"/>
            <bitenum id="ENABLE" value="0x1" description="Enable FIFO Clear"/>
        </bitfield>
    </register>
    <register id="SPGSS2_UC3_UART_IPSPECIFIC_IBRD" width="32" offset="0x7110" description="UART Integer Baud-Rate Divisor Register">
        <bitfield id="DIVINT" description="Integer Baud-Rate Divisor" begin="15" end="0" width="16" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0xFFFF" description="Highest possible value"/>
        </bitfield>
    </register>
    <register id="SPGSS2_UC3_UART_IPSPECIFIC_FBRD" width="32" offset="0x7114" description="UART Fractional Baud-Rate Divisor Register">
        <bitfield id="DIVFRAC" description="Fractional Baud-Rate Divisor" begin="5" end="0" width="6" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0x3F" description="Highest possible value"/>
        </bitfield>
    </register>
    <register id="SPGSS2_UC3_UART_IPSPECIFIC_TXDATA" width="32" offset="0x7120" description="UART Transmit Data Register">
        <bitfield id="DATA" description="Data Transmitted or Received  Data that is to be transmitted via the UART is written to this field.  When read, this field contains the data that was received by the UART." begin="7" end="0" width="8" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0xFF" description="Highest possible value"/>
        </bitfield>
    </register>
    <register id="SPGSS2_UC3_UART_IPSPECIFIC_RXDATA" width="32" offset="0x7124" description="UART Receive Data Register">
        <bitfield id="DATA" description="Received Data.  When read, this field contains the data that was received by the UART." begin="7" end="0" width="8" rwaccess="R">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0xFF" description="Highest possible value"/>
        </bitfield>
        <bitfield id="FRMERR" description="UART Framing Error  Writing to this bit has no effect. The flag is cleared by writing 1 to the FRMERR bit in the UART EVENT ICLR register. This error is associated with the character at the top of the FIFO." begin="8" end="8" width="1" rwaccess="R">
            <bitenum id="CLR" value="0x0" description="No framing error has occurred"/>
            <bitenum id="SET" value="0x1" description="The received character does not have a valid stop bit sequence, which is one or two stop bits depending on the UARTLCRH.STP2 setting (a valid stop bit is 1)."/>
        </bitfield>
        <bitfield id="PARERR" description="UART Parity Error   Writing to this bit has no effect. The flag is cleared by writing 1 to the PARERR bit in the UART EVENT ICLR register." begin="9" end="9" width="1" rwaccess="R">
            <bitenum id="CLR" value="0x0" description="No parity error has occurred"/>
            <bitenum id="SET" value="0x1" description="The parity of the received data character does not match the parity defined by bits 2 and 7 of the UARTLCRH register."/>
        </bitfield>
        <bitfield id="BRKERR" description="UART Break Error  Writing to this bit has no effect. The flag is cleared by writing 1 to the BRKERR bit in the UART EVENT ICLR register. This error is associated with the character at the top of the FIFO. When a break occurs, only one 0 character is loaded into the FIFO. The next character is only enabled after the receive data input goes to a 1 (marking state) and the next valid start bit is received." begin="10" end="10" width="1" rwaccess="R">
            <bitenum id="CLR" value="0x0" description="No break condition has occurred"/>
            <bitenum id="SET" value="0x1" description="A break condition has been detected, indicating that the receive data input was held low for longer than a full-word transmission time (defined as start, data, parity, and stop bits)."/>
        </bitfield>
        <bitfield id="NERR" description="Noise Error.
Writing to this bit has no effect. The flag is cleared by writing 1 to the NERR bit in the UART EVENT ICLR register." begin="11" end="11" width="1" rwaccess="R">
            <bitenum id="CLR" value="0x0" description="No noise error occurred"/>
            <bitenum id="SET" value="0x1" description="Noise error occurred during majority voting"/>
        </bitfield>
    </register>
    <register id="SPGSS2_LINCNT" width="32" offset="0x7130" description="UART LIN Mode Counter Register">
        <bitfield id="VALUE" description="16 bit up counter clocked by the functional clock of the UART." begin="15" end="0" width="16" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0xFFFF" description="Highest possible value"/>
        </bitfield>
    </register>
    <register id="SPGSS2_LINCTL" width="32" offset="0x7134" description="UART LIN Mode Control Register">
        <bitfield id="CTRENA" description="LIN Counter Enable. LIN counter will only count when enabled." begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Counter disabled"/>
            <bitenum id="ENABLE" value="0x1" description="Counter enabled"/>
        </bitfield>
        <bitfield id="ZERONE" description="Zero on negative Edge of RXD. When enabled the counter is set to 0 and starts counting on a negative edge of RXD" begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Zero on negative edge disabled"/>
            <bitenum id="ENABLE" value="0x1" description="Zero on negative edge enabled"/>
        </bitfield>
        <bitfield id="CNTRXLOW" description="Count while low Signal on RXD When counter is enabled and the signal on RXD is low, the counter increments." begin="2" end="2" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Count while low Signal on UARTxRXD disabled"/>
            <bitenum id="ENABLE" value="0x1" description="Count while low Signal on UARTxRXD enabled"/>
        </bitfield>
        <bitfield id="LINC0CAP" description="Capture Counter on negative RXD Edge. When enabled the counter value is captured to LINC0 register on each negative RXD edge. A LINC0 interrupt is triggered when enabled." begin="4" end="4" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Capture counter on negative UARTxRXD edge disabled"/>
            <bitenum id="ENABLE" value="0x1" description="Capture counter on negative UARTxRXD edge enabled"/>
        </bitfield>
        <bitfield id="LINC1CAP" description="Capture Counter on positive RXD Edge. When enabled the counter value is captured to LINC1 register on each positive RXD edge. A LINC1 interrupt is triggered when enabled." begin="5" end="5" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Capture counter on positive UARTxRXD edge disabled"/>
            <bitenum id="ENABLE" value="0x1" description="Capture counter on positive UARTxRXD edge enabled"/>
        </bitfield>
        <bitfield id="LINC0_MATCH" description="Counter Compare Match Mode  When this bit is set to 1 a counter compare match with LINC0 register triggers an LINC0 interrupt when enabled." begin="6" end="6" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Counter compare match mode disabled (capture mode enabled)"/>
            <bitenum id="ENABLE" value="0x1" description="Counter compare match enabled (capture mode disabled)"/>
        </bitfield>
        <bitfield id="EN_FRM_ERR" description="Enable FRAME ERROR" begin="7" end="7" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Disable Frame Error Generation 
If STOP bit of '0' is received, then, FRAME ERROR is not generated"/>
            <bitenum id="ENABLE" value="0x1" description="Enable Frame Error Generation 
If STOP bit of '0' is received, then, FRAME ERROR is generated"/>
        </bitfield>
    </register>
    <register id="SPGSS2_LINC0" width="32" offset="0x7138" description="UART LIN Mode Capture 0 Register">
        <bitfield id="DATA" description="16 Bit Capture / Compare Register 
Captures current LINCTR value on RXD falling edge and can generate a LINC0 interrupt when capture is enabled (LINC0CAP = 1).
If compare mode is enabled (LINC0_MATCH = 1), a counter match can generate a LINC0 interrupt." begin="15" end="0" width="16" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0xFFFF" description="Highest possible value"/>
        </bitfield>
    </register>
    <register id="SPGSS2_LINC1" width="32" offset="0x713C" description="UART LIN Mode Capture 1 Register">
        <bitfield id="DATA" description="16 Bit Capture / Compare Register 
Captures current LINCTR value on RXD rising edge and can generate a LINC1 interrupt when capture is enabled (LINC1CAP = 1)" begin="15" end="0" width="16" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0xFFFF" description="Highest possible value"/>
        </bitfield>
    </register>
    <register id="SPGSS2_UC3_UART_IPSPECIFIC_AMASK" width="32" offset="0x7148" description="Self Address Mask Register">
        <bitfield id="MSK" description="Self Address Mask for 9-Bit Mode  This field contains the address mask that creates a set of addresses that should be matched.  A 0 bit in the MSK bitfield configures, that the corresponding bit in the ADDR bitfield of the UARTxADDR register is don't care. A 1 bit in the MSK bitfield configures, that the corresponding bit in the ADDR bitfield of the UARTxADDR register must match." begin="7" end="0" width="8" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0xFF" description="Highest possible value"/>
        </bitfield>
    </register>
    <register id="SPGSS2_UC3_UART_IPSPECIFIC_ADDR" width="32" offset="0x714C" description="Self Address Register">
        <bitfield id="ADDR" description="Self Address for 9-Bit Mode  This field contains the address that should be matched when UARTxAMASK is FFh." begin="7" end="0" width="8" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0xFF" description="Highest possible value"/>
        </bitfield>
    </register>
    <register id="SPGSS2_UC3_UART_LMGMT_DFT_ATRT_TEST0" width="32" offset="0x7E00" description="Test 0 register">
        <bitfield id="DTB_MUX_SEL" description="This bit field is used to select DTB mux digital output signals." begin="4" end="0" width="5" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Disables DTB MUX"/>
            <bitenum id="GRP1" value="0x1" description="Selects test group 1"/>
            <bitenum id="GRP2" value="0x2" description="Selects test group 2"/>
            <bitenum id="GRP3" value="0x3" description="Selects test group 3"/>
            <bitenum id="GRP4" value="0x4" description="Selects test group 4"/>
            <bitenum id="GRP5" value="0x5" description="Selects test group 5"/>
            <bitenum id="GRP6" value="0x6" description="Selects test group 6"/>
            <bitenum id="GRP7" value="0x7" description="Selects test group 7"/>
        </bitfield>
    </register>
