ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/msp/mspm33c321x/SPGSS2_1.0.xml
    <register id="SPGSS2_UC2_I2CC_IPSPECIFIC_TA" width="32" offset="0x2514C" description="Target Address Register">
        <bitfield id="DIR" description="Receive/Send
The DIR bit specifies if the next operation is a Receive (High) or Transmit (Low).
0h = Transmit
1h = Receive" begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="TRANSMIT" value="0x0" description="in transmit mode."/>
            <bitenum id="RECEIVE" value="0x1" description="is in receive mode."/>
        </bitfield>
        <bitfield id="ADDR" description="I2C Target Address This field specifies bits A9 through A0 of the Target address.
In 7-bit addressing mode as selected by MSA.MODE bit, the top 3 bits are don't care" begin="10" end="1" width="10" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0x3FF" description="Highest possible value"/>
        </bitfield>
        <bitfield id="MODE" description="This bit selects the adressing mode to be used 
When 0, 7-bit addressing is used.
When 1, 10-bit addressing is used." begin="15" end="15" width="1" rwaccess="R/W">
            <bitenum id="MODE7" value="0x0" description="7-bit addressing mode"/>
            <bitenum id="MODE10" value="0x1" description="10-bit addressing mode"/>
        </bitfield>
    </register>
    <register id="SPGSS2_UC2_I2CC_IPSPECIFIC_TIMEOUT_CNT" width="32" offset="0x25150" description="I2C Timeout Count Register">
        <bitfield id="TCNTA" description="Timeout Count A Current Count: This field contains the upper 8 bits of a 12-bit current counter for timeout counter A" begin="7" end="0" width="8" rwaccess="R">
            <bitenum id="MINIMUM" value="0x0" description="Smallest Value"/>
            <bitenum id="MAXIMUM" value="0xFF" description="Highest possible value"/>
        </bitfield>
    </register>
    <register id="SPGSS2_UC2_I2CC_IPSPECIFIC_TIMEOUT_CTL" width="32" offset="0x25154" description="I2C Timeout Count Control Register">
        <bitfield id="TCNTLA" description="Timeout counter A load value
Counter A is used for SCL low detection. This field contains the upper 8 bits of a 12-bit pre-load value for the Timeout A count. NOTE: The value of CNTLA must be greater than 1h. 
Each count is equal to 520 times the timeout period of functional clock. For example, with 8MHz functional clock and a 100KHz operating I2C clock, one timeout period will be equal to (1 / 8MHz) * 520 or 65 us." begin="7" end="0" width="8" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Smallest Value"/>
            <bitenum id="MAXIMUM" value="0xFF" description="Highest possible value"/>
        </bitfield>
        <bitfield id="TCNTAEN" description="Timeout Counter A Enable" begin="15" end="15" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Disable Timeout Counter B"/>
            <bitenum id="ENABLE" value="0x1" description="Enable Timeout Counter B"/>
        </bitfield>
    </register>
    <register id="SPGSS2_UC2_I2CC_LMGMT_DFT_ATRT_TEST0" width="32" offset="0x25E00" description="Test 0 register">
        <bitfield id="DTB_MUX_SEL" description="This bit field is used to select DTB mux digital output signals." begin="4" end="0" width="5" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Disables DTB MUX"/>
            <bitenum id="GRP1" value="0x1" description="Selects test group 1"/>
            <bitenum id="GRP2" value="0x2" description="Selects test group 2"/>
            <bitenum id="GRP3" value="0x3" description="Selects test group 3"/>
            <bitenum id="GRP4" value="0x4" description="Selects test group 4"/>
            <bitenum id="GRP5" value="0x5" description="Selects test group 5"/>
            <bitenum id="GRP6" value="0x6" description="Selects test group 6"/>
            <bitenum id="GRP7" value="0x7" description="Selects test group 7"/>
        </bitfield>
    </register>
    <register id="SPGSS2_UC3_I2CC_IPSTANDARD_CLKDIV" width="32" offset="0x27000" description="Clock Divider">
        <bitfield id="RATIO" description="Selects divide ratio of module clock
Division factor
0 : DIV_BY_1
1 : DIV_BY_2
....
63: DIV_BY_64" begin="2" end="0" width="3" rwaccess="R/W">
            <bitenum id="DIV_BY_1" value="0x0" description="Do not divide clock source"/>
            <bitenum id="DIV_BY_2" value="0x1" description="Divide clock source by 2"/>
            <bitenum id="DIV_BY_3" value="0x2" description="Divide clock source by 3"/>
            <bitenum id="DIV_BY_4" value="0x3" description="Divide clock source by 4"/>
            <bitenum id="DIV_BY_5" value="0x4" description="Divide clock source by 5"/>
            <bitenum id="DIV_BY_6" value="0x5" description="Divide clock source by 6"/>
            <bitenum id="DIV_BY_7" value="0x6" description="Divide clock source by 7"/>
            <bitenum id="DIV_BY_8" value="0x7" description="Divide clock source by 8"/>
            <bitenum id="DIV_BY_61" value="0x3C" description="Divide clock source by 8"/>
            <bitenum id="DIV_BY_62" value="0x3D" description="Divide clock source by 8"/>
            <bitenum id="DIV_BY_63" value="0x3E" description="Divide clock source by 8"/>
            <bitenum id="DIV_BY_64" value="0x3F" description="Divide clock source by 8"/>
        </bitfield>
    </register>
    <register id="SPGSS2_UC3_I2CC_IPSTANDARD_CLKSEL" width="32" offset="0x27008" description="Clock Select for Ultra Low Power peripherals">
        <bitfield id="BUSCLK_SEL" description="Selects BUS CLK as clock source if enabled" begin="3" end="3" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Does not select this clock as a source"/>
            <bitenum id="ENABLE" value="0x1" description="Select this clock as a source"/>
        </bitfield>
    </register>
    <register id="SPGSS2_UC3_I2CC_IPSTANDARD_PDBGCTL" width="32" offset="0x27018" description="Peripheral Debug Control">
        <bitfield id="FREE" description="Free run control" begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="STOP" value="0x0" description="The peripheral freezes functionality while the Core Halted input is asserted and resumes when it is deasserted."/>
            <bitenum id="RUN" value="0x1" description="The peripheral ignores the state of the Core Halted input"/>
        </bitfield>
        <bitfield id="SOFT" description="Soft halt boundary control. This function is only available, if [FREE] is set to 'STOP'" begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="DEPRECATED" value="0x0" description="Not supported"/>
            <bitenum id="DELAYED" value="0x1" description="The peripheral blocks the debug freeze until it has reached a boundary where it can resume without corruption"/>
        </bitfield>
    </register>
