ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/msp/mspm33c321x/SPGSS2_1.0.xml
    <register id="SPGSS2_UC3_I2CC_IPSPECIFIC_BMON" width="32" offset="0x2711C" description="Bus Monitor">
        <bitfield id="SCL" description="I2C SCL Status" begin="0" end="0" width="1" rwaccess="R">
            <bitenum id="CLEARED" value="0x0" description="The I2CSCL signal is low."/>
            <bitenum id="SET" value="0x1" description="The I2CSCL signal is high. Note: During and right after reset, the SCL pin is in GPIO input mode without the internal pull enabled. For proper I2C operation, the user should have the external pull-up resistor in place before starting any I2C operations."/>
        </bitfield>
        <bitfield id="SDA" description="I2C SDA Status" begin="1" end="1" width="1" rwaccess="R">
            <bitenum id="CLEARED" value="0x0" description="The I2CSDA signal is low."/>
            <bitenum id="SET" value="0x1" description="The I2CSDA signal is high. Note: During and right after reset, the SDA pin is in GPIO input mode without the internal pull enabled. For proper I2C operation, the user should have the external pull-up resistor in place before starting any I2C operations."/>
        </bitfield>
    </register>
    <register id="SPGSS2_UC3_I2CC_IPSPECIFIC_TXDATA" width="32" offset="0x27120" description="TXData">
        <bitfield id="DATA" description="Transmit Data
This byte contains the data to be transferred during the next transaction." begin="7" end="0" width="8" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0xFF" description="Highest possible value"/>
        </bitfield>
    </register>
    <register id="SPGSS2_UC3_I2CC_IPSPECIFIC_RXDATA" width="32" offset="0x27124" description="RXData">
        <bitfield id="DATA" description="Received Data. 
This field contains the last received data." begin="7" end="0" width="8" rwaccess="R">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0xFF" description="Highest possible value"/>
        </bitfield>
    </register>
    <register id="SPGSS2_UC3_I2CC_IPSPECIFIC_PECSR" width="32" offset="0x27128" description="PEC status register">
        <bitfield id="PECBYTECNT" description="PEC Byte Count	
This is the current PEC Byte Count of the Controller State Machine." begin="8" end="0" width="9" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Minimum Value"/>
            <bitenum id="MAXIMUM" value="0x1FF" description="Maximum Value"/>
        </bitfield>
        <bitfield id="PECSTS_CHECK" description="This status bit indicates if the PEC was checked in the transaction that occurred before the last Stop. Latched on Stop." begin="16" end="16" width="1" rwaccess="R/W">
            <bitenum id="CLEARED" value="0x0" description="Indicates PEC was not checked in the transaction that occurred before the last Stop"/>
            <bitenum id="SET" value="0x1" description="Indicates if the PEC was checked in the transaction that occurred before the last Stop"/>
        </bitfield>
        <bitfield id="PECSTS_ERROR" description="This status bit indicates if a PEC check error occurred in the transaction that occurred before the last Stop. Latched on Stop." begin="17" end="17" width="1" rwaccess="R/W">
            <bitenum id="CLEARED" value="0x0" description="Indicates PEC check error did not occurr in the transaction that occurred before the last Stop"/>
            <bitenum id="SET" value="0x1" description="Indicates if a PEC check error occurred in the transaction that occurred before the last Stop"/>
        </bitfield>
    </register>
    <register id="SPGSS2_UC3_I2CC_IPSPECIFIC_TA" width="32" offset="0x2714C" description="Target Address Register">
        <bitfield id="DIR" description="Receive/Send
The DIR bit specifies if the next operation is a Receive (High) or Transmit (Low).
0h = Transmit
1h = Receive" begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="TRANSMIT" value="0x0" description="in transmit mode."/>
            <bitenum id="RECEIVE" value="0x1" description="is in receive mode."/>
        </bitfield>
        <bitfield id="ADDR" description="I2C Target Address This field specifies bits A9 through A0 of the Target address.
In 7-bit addressing mode as selected by MSA.MODE bit, the top 3 bits are don't care" begin="10" end="1" width="10" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0x3FF" description="Highest possible value"/>
        </bitfield>
        <bitfield id="MODE" description="This bit selects the adressing mode to be used 
When 0, 7-bit addressing is used.
When 1, 10-bit addressing is used." begin="15" end="15" width="1" rwaccess="R/W">
            <bitenum id="MODE7" value="0x0" description="7-bit addressing mode"/>
            <bitenum id="MODE10" value="0x1" description="10-bit addressing mode"/>
        </bitfield>
    </register>
    <register id="SPGSS2_UC3_I2CC_IPSPECIFIC_TIMEOUT_CNT" width="32" offset="0x27150" description="I2C Timeout Count Register">
        <bitfield id="TCNTA" description="Timeout Count A Current Count: This field contains the upper 8 bits of a 12-bit current counter for timeout counter A" begin="7" end="0" width="8" rwaccess="R">
            <bitenum id="MINIMUM" value="0x0" description="Smallest Value"/>
            <bitenum id="MAXIMUM" value="0xFF" description="Highest possible value"/>
        </bitfield>
        <bitfield id="TCNTB" description="Timeout Count B Current Count: This field contains the upper 8 bits of a 12-bit current counter for timeout counter B" begin="23" end="16" width="8" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Smallest Value"/>
            <bitenum id="MAXIMUM" value="0xFF" description="Highest possible value"/>
        </bitfield>
    </register>
    <register id="SPGSS2_UC3_I2CC_IPSPECIFIC_TIMEOUT_CTL" width="32" offset="0x27154" description="I2C Timeout Count Control Register">
        <bitfield id="TCNTLA" description="Timeout counter A load value
Counter A is used for SCL low detection. This field contains the upper 8 bits of a 12-bit pre-load value for the Timeout A count. NOTE: The value of CNTLA must be greater than 1h. 
Each count is equal to 520 times the timeout period of functional clock. For example, with 8MHz functional clock and a 100KHz operating I2C clock, one timeout period will be equal to (1 / 8MHz) * 520 or 65 us." begin="7" end="0" width="8" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Smallest Value"/>
            <bitenum id="MAXIMUM" value="0xFF" description="Highest possible value"/>
        </bitfield>
        <bitfield id="TCNTAEN" description="Timeout Counter A Enable" begin="15" end="15" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Disable Timeout Counter B"/>
            <bitenum id="ENABLE" value="0x1" description="Enable Timeout Counter B"/>
        </bitfield>
        <bitfield id="TCNTLB" description="Timeout Count B Load: Counter B is used for SCL High Detection. This field contains the upper 8 bits of a 12-bit pre-load value for the Timeout B count. NOTE: The value of CNTLB must be greater than 1h. 
Each count is equal to 1* clock period. For example, with 10MHz functional clock one timeout period will be equal to1*100ns." begin="23" end="16" width="8" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Smallest possible value"/>
            <bitenum id="MAXIMUM" value="0xFF" description="Highest possible value"/>
        </bitfield>
        <bitfield id="TCNTBEN" description="Timeout Counter B Enable" begin="31" end="31" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Disable Timeout Counter B"/>
            <bitenum id="ENABLE" value="0x1" description="Enable Timeout Counter B"/>
        </bitfield>
    </register>
