ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/msp/mspm33c321x/SPGSS2_1.0.xml
    <register id="SPGSS2_UC3_I2CC_IPSPECIFIC_PECCTL" width="32" offset="0x27158" description="I2C PEC control register">
        <bitfield id="PECCNT" description="PEC Count
When this field is non zero, the number of I2C bytes are counted (Note that although the PEC is calculated on the I2C address it is not counted at a byte). When the byte count = PECCNT and the state machine is transmitting, the contents of the LSFR is loaded into the shift register instead of the byte received from the Tx FIFO. When the state machine is receiving, after the last bit of this byte is received the LSFR is checked and if it is non-zero, a PEC RX Error interrupt is generated. The I2C packet must be padded to include the PEC byte for both transmit and receive. In transmit mode the FIFO must be loaded with a dummy PEC byte. In receive mode the PEC byte will be passed to the Rx FIFO.
In the normal Controller use case, FW would set PECEN=1 and PECCNT=SMB packet length (Not including Target Address byte, but including the PEC byte). FW would then configure DMA to allow the packet to complete unassisted and write MCTR to initiate the transaction.
Note that when the byte count = PEC CNT, the byte count is reset to 0 and multiple PEC calculation can automatically occur within a single I2C transaction.
Note that any write to the I2PECCTL Register will clear the current PEC Byte Count in the State Machine." begin="8" end="0" width="9" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Minimum Value"/>
            <bitenum id="MAXIMUM" value="0x1FF" description="Maximum Value"/>
        </bitfield>
        <bitfield id="PECEN" description="PEC Enable
This bit enables the SMB Packet Error Checking (PEC). When enabled the PEC is calculated on all bits except the Start, Stop, Ack and Nack. The PEC LSFR and the Byte Counter is set to 0 when the State Machine is in the IDLE state, which occur following a Stop or when a timeout occurs. The Counter is also set to 0 after the PEC byte is sent or received. Note that the NACK is automatically send following a PEC byte that results in a PEC error.
The PEC Polynomial is x^8 + x^2 + x^1 + 1." begin="12" end="12" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="PEC is disabled"/>
            <bitenum id="ENABLE" value="0x1" description="PEC is enabled"/>
        </bitfield>
    </register>
    <register id="SPGSS2_UC3_I2CC_LMGMT_DFT_ATRT_TEST0" width="32" offset="0x27E00" description="Test 0 register">
        <bitfield id="DTB_MUX_SEL" description="This bit field is used to select DTB mux digital output signals." begin="4" end="0" width="5" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Disables DTB MUX"/>
            <bitenum id="GRP1" value="0x1" description="Selects test group 1"/>
            <bitenum id="GRP2" value="0x2" description="Selects test group 2"/>
            <bitenum id="GRP3" value="0x3" description="Selects test group 3"/>
            <bitenum id="GRP4" value="0x4" description="Selects test group 4"/>
            <bitenum id="GRP5" value="0x5" description="Selects test group 5"/>
            <bitenum id="GRP6" value="0x6" description="Selects test group 6"/>
            <bitenum id="GRP7" value="0x7" description="Selects test group 7"/>
        </bitfield>
    </register>
    <register id="SPGSS2_UC3_I2CC_LMGMT_DFT_ATRT_TEST1" width="32" offset="0x27E04" description="Test 0 register">
        <bitfield id="SCL_TRIM_EN" description="Analog glitch filter trimming enable for SCL" begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Disable Trim for SCL"/>
            <bitenum id="ENABLE" value="0x1" description="Enable Trim for SCL"/>
        </bitfield>
        <bitfield id="SDA_TRIM_EN" description="Analog glitch filter trimming enable for SDA" begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Disable Trim for SDA"/>
            <bitenum id="ENABLE" value="0x1" description="Enable Trim for SDA"/>
        </bitfield>
        <bitfield id="TRIM_SEL" description="Select for which branch to trim" begin="2" end="2" width="1" rwaccess="R/W">
            <bitenum id="FALLING_EDGE" value="0x0" description="Select Trim on falling edge"/>
            <bitenum id="RISING_EDGE" value="0x1" description="Select Trim on rising edge"/>
        </bitfield>
        <bitfield id="AGFTEST" description="" begin="8" end="8" width="1" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="SPGSS2_UC0_I2CT_IPSTANDARD_CLKDIV" width="32" offset="0x41000" description="Clock Divider">
        <bitfield id="RATIO" description="Selects divide ratio of module clock
Division factor
0 : DIV_BY_1
1 : DIV_BY_2
....
63: DIV_BY_64" begin="2" end="0" width="3" rwaccess="R/W">
            <bitenum id="DIV_BY_1" value="0x0" description="Do not divide clock source"/>
            <bitenum id="DIV_BY_2" value="0x1" description="Divide clock source by 2"/>
            <bitenum id="DIV_BY_3" value="0x2" description="Divide clock source by 3"/>
            <bitenum id="DIV_BY_4" value="0x3" description="Divide clock source by 4"/>
            <bitenum id="DIV_BY_5" value="0x4" description="Divide clock source by 5"/>
            <bitenum id="DIV_BY_6" value="0x5" description="Divide clock source by 6"/>
            <bitenum id="DIV_BY_7" value="0x6" description="Divide clock source by 7"/>
            <bitenum id="DIV_BY_8" value="0x7" description="Divide clock source by 8"/>
            <bitenum id="DIV_BY_61" value="0x3C" description="Divide clock source by 8"/>
            <bitenum id="DIV_BY_62" value="0x3D" description="Divide clock source by 8"/>
            <bitenum id="DIV_BY_63" value="0x3E" description="Divide clock source by 8"/>
            <bitenum id="DIV_BY_64" value="0x3F" description="Divide clock source by 8"/>
        </bitfield>
    </register>
    <register id="SPGSS2_UC0_I2CT_IPSTANDARD_CLKSEL" width="32" offset="0x41008" description="Clock Select for Ultra Low Power peripherals">
        <bitfield id="BUSCLK_SEL" description="Selects BUS CLK as clock source if enabled" begin="3" end="3" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Does not select this clock as a source"/>
            <bitenum id="ENABLE" value="0x1" description="Select this clock as a source"/>
        </bitfield>
    </register>
    <register id="SPGSS2_UC0_I2CT_IPSTANDARD_PDBGCTL" width="32" offset="0x41018" description="Peripheral Debug Control">
        <bitfield id="FREE" description="Free run control" begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="STOP" value="0x0" description="The peripheral freezes functionality while the Core Halted input is asserted and resumes when it is deasserted."/>
            <bitenum id="RUN" value="0x1" description="The peripheral ignores the state of the Core Halted input"/>
        </bitfield>
        <bitfield id="SOFT" description="Soft halt boundary control. This function is only available, if [FREE] is set to 'STOP'" begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="DEPRECATED" value="0x0" description="Not supported"/>
            <bitenum id="DELAYED" value="0x1" description="The peripheral blocks the debug freeze until it has reached a boundary where it can resume without corruption"/>
        </bitfield>
    </register>
    <group id="SPGSS2_UC0_I2CT_IPSTANDARD_CPU_INT" name="SPGSS2_UC0_I2CT_IPSTANDARD_CPU_INT" instances="1" offset="0x41020" instaddr="0x30" description="">
        <register id="SPGSS2_UC0_I2CT_IPSTANDARD_IIDX" width="32" offset="0x0" description="Interrupt index">
            <bitfield id="STAT" description="I2C Module Interrupt Vector Value.  This register provides the highes priority interrupt index. A read clears the corresponding interrupt flag in RIS and MISC. 15h-1Fh = Reserved" begin="7" end="0" width="8" rwaccess="R">
                <bitenum id="NO_INTR" value="0x0" description="No interrupt pending"/>
                <bitenum id="RXDONEFG" value="0x1" description="Receive Done Flag"/>
                <bitenum id="TXDONEFG" value="0x2" description="Transmit Done Flag"/>
                <bitenum id="RXTRG" value="0x3" description="receive FIFO Trigger Level"/>
                <bitenum id="TXTRG" value="0x4" description="transmit FIFO Trigger level"/>
                <bitenum id="RXFULL" value="0x5" description="RX FIFO FULL Event/interrupt pending"/>
                <bitenum id="TXEMPTY" value="0x6" description="Transmit FIFO/Buffer Empty Event/interrupt pending"/>
                <bitenum id="TX_UNFL" value="0x7" description="Target TX FIFO underflow"/>
                <bitenum id="RX_OVFL" value="0x8" description="Target RX FIFO overflow event"/>
                <bitenum id="GENCALL" value="0x9" description="General Call Event"/>
                <bitenum id="STARTFG" value="0xA" description="Start Event"/>
                <bitenum id="STOPFG" value="0xB" description="Stop Event"/>
                <bitenum id="PEC_RX_ERR" value="0xC" description="PEC receive error event"/>
                <bitenum id="TIMEOUTA" value="0xD" description="Timeout A Event"/>
                <bitenum id="TIMEOUTB" value="0xE" description="Timeout B Event"/>
                <bitenum id="DMA_DONE_RX" value="0x10" description="DMA DONE on Channel RX"/>
                <bitenum id="DMA_DONE_TX" value="0x11" description="DMA DONE on Channel TX"/>
                <bitenum id="ARBLOSTFG" value="0x12" description="Arbitration Lost"/>
                <bitenum id="DMA_PREIRQ_RX" value="0x13" description="DMA PRE IRQ INTERRUPT"/>
                <bitenum id="DMA_PREIRQ_TX" value="0x14" description="DMA PRE IRQ INTERRUPT"/>
            </bitfield>
        </register>
        <register id="SPGSS2_UC0_I2CT_IPSTANDARD_CPU_INT_IMASK" width="32" offset="0x8" description="Interrupt mask">
            <bitfield id="RXDONE" description="Receive Data Interrupt
Signals that a byte has been received" begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Clear Interrupt Mask"/>
                <bitenum id="SET" value="0x1" description="Set Interrupt Mask"/>
            </bitfield>
            <bitfield id="TXDONE" description="Transmit Transaction completed Interrupt" begin="1" end="1" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Clear Interrupt Mask"/>
                <bitenum id="SET" value="0x1" description="Set Interrupt Mask"/>
            </bitfield>
            <bitfield id="GENCALL" description="General Call Interrupt" begin="8" end="8" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Clear Interrupt Mask"/>
                <bitenum id="SET" value="0x1" description="Set Interrupt Mask"/>
            </bitfield>
            <bitfield id="RXTRG" description="Receive Trigger" begin="2" end="2" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Clear Interrupt Mask"/>
                <bitenum id="SET" value="0x1" description="Set Interrupt Mask"/>
            </bitfield>
            <bitfield id="TXTRG" description="Transmit Trigger" begin="3" end="3" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Clear Interrupt Mask"/>
                <bitenum id="SET" value="0x1" description="Set Interrupt Mask"/>
            </bitfield>
            <bitfield id="START" description="Start Condition Interrupt" begin="9" end="9" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Clear Interrupt Mask"/>
                <bitenum id="SET" value="0x1" description="Set Interrupt Mask"/>
            </bitfield>
            <bitfield id="STOP" description="Stop Condition Interrupt" begin="10" end="10" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Clear Interrupt Mask"/>
                <bitenum id="SET" value="0x1" description="Set Interrupt Mask"/>
            </bitfield>
            <bitfield id="DMA_DONE_TX" description="DMA Done on Event Channel TX" begin="16" end="16" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Clear Interrupt Mask"/>
                <bitenum id="SET" value="0x1" description="Set Interrupt Mask"/>
            </bitfield>
            <bitfield id="DMA_DONE_RX" description="DMA Done on Event Channel RX" begin="15" end="15" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Clear Interrupt Mask"/>
                <bitenum id="SET" value="0x1" description="Set Interrupt Mask"/>
            </bitfield>
            <bitfield id="TIMEOUTA" description="Timeout A Interrupt" begin="12" end="12" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Clear Interrupt Mask"/>
                <bitenum id="SET" value="0x1" description="Set Interrupt Mask"/>
            </bitfield>
            <bitfield id="RXFULL" description="RXFIFO full event. This interrupt is set if an Target RX FIFO is full." begin="4" end="4" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Clear Interrupt Mask"/>
                <bitenum id="SET" value="0x1" description="Set Interrupt Mask"/>
            </bitfield>
            <bitfield id="TXEMPTY" description="Target Transmit FIFO Empty interrupt mask. This interrupt is set if all data in the Transmit FIFO have been shifted out and the transmit goes into idle mode." begin="5" end="5" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Clear Interrupt Mask"/>
                <bitenum id="SET" value="0x1" description="Set Interrupt Mask"/>
            </bitfield>
            <bitfield id="TX_UNFL" description="Target TX FIFO underflow" begin="6" end="6" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Clear Interrupt Mask"/>
                <bitenum id="SET" value="0x1" description="Set Interrupt Mask"/>
            </bitfield>
            <bitfield id="RX_OVFL" description="Target RX FIFO overflow" begin="7" end="7" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Clear Interrupt Mask"/>
                <bitenum id="SET" value="0x1" description="Set Interrupt Mask"/>
            </bitfield>
        </register>
