ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/msp/mspm33c321x/SPGSS2_1.0.xml
        </group>
    <group id="SPGSS2_UC0_I2CT_IPSTANDARD_DMA_TRIG0" name="SPGSS2_UC0_I2CT_IPSTANDARD_DMA_TRIG0" instances="1" offset="0x41080" instaddr="0x30" description="">
        <register id="SPGSS2_UC0_I2CT_IPSTANDARD_DMA_TRIG0_IMASK" width="32" offset="0x8" description="Interrupt mask">
            <bitfield id="TXTRG" description="Transmit Trigger" begin="3" end="3" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Clear Interrupt Mask"/>
                <bitenum id="SET" value="0x1" description="Set Interrupt Mask"/>
            </bitfield>
        </register>
        <register id="SPGSS2_UC0_I2CT_IPSTANDARD_DMA_TRIG0_RIS" width="32" offset="0x10" description="Raw interrupt status">
            <bitfield id="TXTRG" description="Transmit Trigger" begin="3" end="3" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Clear Interrupt Mask"/>
                <bitenum id="SET" value="0x1" description="Set Interrupt Mask"/>
            </bitfield>
        </register>
        <register id="SPGSS2_UC0_I2CT_IPSTANDARD_DMA_TRIG0_MIS" width="32" offset="0x18" description="Masked interrupt status">
            <bitfield id="TXTRG" description="Transmit Trigger" begin="3" end="3" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Clear Interrupt Mask"/>
                <bitenum id="SET" value="0x1" description="Set Interrupt Mask"/>
            </bitfield>
        </register>
        <register id="SPGSS2_UC0_I2CT_IPSTANDARD_DMA_TRIG0_ISET" width="32" offset="0x20" description="Interrupt set">
            <bitfield id="TXTRG" description="Transmit Trigger" begin="3" end="3" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Clear Interrupt Mask"/>
                <bitenum id="SET" value="0x1" description="Set Interrupt Mask"/>
            </bitfield>
        </register>
        </group>
    <register id="SPGSS2_UC0_I2CT_IPSTANDARD_INTCTL" width="32" offset="0x410E4" description="Interrupt control register">
        <bitfield id="INTEVAL" description="Writing a 1 to this field re-evaluates the interrupt sources." begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="The interrupt or event line is disabled."/>
            <bitenum id="EVAL" value="0x1" description="The interrupt or event line is in software mode. Software must clear the RIS."/>
        </bitfield>
    </register>
    <register id="SPGSS2_UC0_I2CT_IPSPECIFIC_CTR" width="32" offset="0x41100" description="I2C Target Control Register">
        <bitfield id="ENABLE" description="Setting this bit enables the module." begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Disables module operation."/>
            <bitenum id="ENABLE" value="0x1" description="Enables module operation."/>
        </bitfield>
        <bitfield id="GENCALL" description="General call response enable
Modify only when UCSWRST = 1.
0b = Do not respond to a general call
1b = Respond to a general call" begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Do not respond to a general call"/>
            <bitenum id="ENABLE" value="0x1" description="Respond to a general call"/>
        </bitfield>
        <bitfield id="CLKSTRETCH" description="Clock Stretch Enable" begin="20" end="20" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="clock stretching is disabled"/>
            <bitenum id="ENABLE" value="0x1" description="clock stretching is enabled"/>
        </bitfield>
        <bitfield id="TXEMPTY_ON_TREQ" description="Tx Empty Interrupt on TREQ" begin="3" end="3" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="When 0, RIS:TXEMPTY will be set when only the Target TX FIFO is empty.
This allows the TXEMPTY interrupt to be used to indicate that the I2C bus is being clock stretched and that Target TX data is required."/>
            <bitenum id="ENABLE" value="0x1" description="When 1, RIS:TXEMPTY will be set when the Target State Machine is in the TX_WAIT state which occurs when the TX FIFO is empty AND the I2C transaction is clock stretched waiting for the FIFO to receive data."/>
        </bitfield>
        <bitfield id="TXTRIG_TXMODE" description="Tx Trigger when Target FSM is in Tx Mode" begin="4" end="4" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="No special behavior"/>
            <bitenum id="ENABLE" value="0x1" description="When 1, RIS:TXTRG will be set when the Target TX FIFO has reached the trigger level AND the Target State Machine is in the TXMODE as defined in the SSR register.
When cleared RIS:TXTRG will be set when the Target TX FIFO is at or above the trigger level.
This setting can be used to hold off the TX DMA until a transaction starts.
This allows the DMA to be configured when the I2C is idle but have it wait till the transaction starts to load the Target TX FIFO, so it can load from a memory buffer that might be changing over time."/>
        </bitfield>
        <bitfield id="TXWAIT_STALE_TXFIFO" description="Tx transfer waits when stale data in Tx FIFO.
This prevents stale bytes left in the TX FIFO from automatically being sent on the next I2C packet. Note: this should be used with TXEMPTY_ON_TREQ set to prevent the Target State Machine from waiting for TX FIFO data without an interrupt notification when the FIFO data is stale." begin="5" end="5" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="When 0, the TX FIFO empty signal to the Target State Machine indicates that the TX FIFO is empty."/>
            <bitenum id="ENABLE" value="0x1" description="When 1, the TX FIFO empty signal to the Target State Machine will indicate that the TX FIFO is empty or that the TX FIFO data is stale. The TX FIFO data is determined to be stale when there is data in the TX FIFO when the Target State Machine leaves the TXMODE as defined in the SSR register. This can occur is a Stop or timeout occur when there are bytes left in the TX FIFO."/>
        </bitfield>
        <bitfield id="RXFULL_ON_RREQ" description="Rx full interrupt generated on RREQ condition as indicated in SSR" begin="6" end="6" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="When 0, RIS:SRXFULL will be set when only the Target RX FIFO is full.
This allows the SRXFULL interrupt to be used to indicate that the I2C bus is being clock stretched and that the FW must either read the RX FIFO or ACK/NACK the current Rx byte."/>
            <bitenum id="ENABLE" value="0x1" description="When 1, RIS:SRXFULL will be set when the Target State Machine is in the RX_WAIT or RX_ACK_WAIT states which occurs when the I2C transaction is clock stretched because the RX FIFO is full or the ACKOEN has been set and the state machine is waiting for FW to ACK/NACK the current byte."/>
        </bitfield>
        <bitfield id="WUEN" description="Target Wakeup Enable" begin="21" end="21" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="When 0, the Target is not allowed to clock stretch on START detection"/>
            <bitenum id="ENABLE" value="0x1" description="When 1, the Target is allowed to clock stretch on START detection and wait for faster clock to be abvailable. This allows clean wake up support for I2C in low power mode use cases"/>
        </bitfield>
        <bitfield id="SUSPEND" description="Suspend external communication" begin="11" end="11" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Functional mode resumed"/>
            <bitenum id="ENABLE" value="0x1" description="External communication suspended"/>
        </bitfield>
    </register>
    <register id="SPGSS2_UC0_I2CT_IPSPECIFIC_ACKCTL" width="32" offset="0x41104" description="I2C Target ACK Control">
        <bitfield id="ACKOEN" description="I2C Target ACK Override Enable  
Read SR.ACKOEN to check current status of this bit" begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="A response in not provided."/>
            <bitenum id="ENABLE" value="0x1" description="An ACK or NACK is sent according to the value written to the ACKOVAL bit."/>
        </bitfield>
        <bitfield id="ACKOVAL" description="ACK Override Value
Note: Override control is not applicable to Address frame. Bytes following address frame can be acknowledged using ACKOVAL." begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="An ACK is sent indicating valid data or command."/>
            <bitenum id="ENABLE" value="0x1" description="A NACK is sent indicating invalid data or command."/>
        </bitfield>
    </register>
