ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/msp/mspm33c321x/SPGSS2_1.0.xml
    <register id="SPGSS2_UC2_SPI_LMGMT_DFT_ATRT_TEST0" width="32" offset="0x65E00" description="Test 0 Register">
        <bitfield id="DTB_MUX_SEL" description="This bit field is used to select DTB mux digital output signals." begin="3" end="0" width="4" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Disables DTB MUX"/>
            <bitenum id="GRP1" value="0x1" description="Selects test group 1"/>
            <bitenum id="GRP2" value="0x2" description="Selects test group 2"/>
            <bitenum id="GRP3" value="0x3" description="Selects test group 3"/>
            <bitenum id="GRP4" value="0x4" description="Selects test group 4"/>
            <bitenum id="GRP5" value="0x5" description="Selects test group 5"/>
            <bitenum id="GRP6" value="0x6" description="Selects test group 6"/>
            <bitenum id="GRP7" value="0x7" description="Selects test group 7"/>
            <bitenum id="GRP8" value="0x8" description="Selects test group 8"/>
            <bitenum id="GRP9" value="0x9" description="Selects test group 9"/>
        </bitfield>
    </register>
    <group id="SPGSS2_EXT_GPRCM_UC0_GPRCM" name="SPGSS2_EXT_GPRCM_UC0_GPRCM" instances="1" offset="0x80800" instaddr="0x100" description="">
        <register id="SPGSS2_EXT_GPRCM_UC0_PWREN" width="32" offset="0x0" description="Power enable">
            <bitfield id="ENABLE" description="Enable the power" begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="DISABLE" value="0x0" description="Disable Power"/>
                <bitenum id="ENABLE" value="0x1" description="Enable Power"/>
            </bitfield>
        </register>
        <register id="SPGSS2_EXT_GPRCM_UC0_RSTCTL" width="32" offset="0x4" description="Reset Control">
            <bitfield id="RESETSTKYCLR" description="Clear the RESETSTKY bit in the STAT register" begin="1" end="1" width="1" rwaccess="R/W">
                <bitenum id="NOP" value="0x0" description="Writing 0 has no effect"/>
                <bitenum id="CLR" value="0x1" description="Clear reset sticky bit"/>
            </bitfield>
            <bitfield id="RESETASSERT" description="Assert reset to the peripheral" begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="NOP" value="0x0" description="Writing 0 has no effect"/>
                <bitenum id="ASSERT" value="0x1" description="Assert reset"/>
            </bitfield>
        </register>
        <register id="SPGSS2_EXT_GPRCM_UC0_CLKCFG" width="32" offset="0x8" description="Peripheral Clock Configuration Register">
            <bitfield id="BLOCKASYNC" description="Async Clock Request is blocked from starting SYSOSC or forcing bus clock to 32MHz" begin="8" end="8" width="1" rwaccess="R/W">
                <bitenum id="DISABLE" value="0x0" description="Not block async clock request"/>
                <bitenum id="ENABLE" value="0x1" description="Block async clock request"/>
            </bitfield>
        </register>
        <register id="SPGSS2_EXT_GPRCM_UC0_GPRCM_STAT" width="32" offset="0x14" description="Status Register">
            <bitfield id="RESETSTKY" description="This bit indicates, if the peripheral was reset, since this bit was cleared by RESETSTKYCLR in the RSTCTL register" begin="16" end="16" width="1" rwaccess="R">
                <bitenum id="NORES" value="0x0" description="The peripheral has not been reset since this bit was last cleared by RESETSTKYCLR in the RSTCTL register"/>
                <bitenum id="RESET" value="0x1" description="The peripheral was reset since the last bit clear"/>
            </bitfield>
        </register>
        </group>
    <register id="SPGSS2_UC0_IPSPECIFIC_IPMODE" width="32" offset="0x81100" description="Mode Selection Register">
        <bitfield id="SELECT" description="Free run control" begin="1" end="0" width="2" rwaccess="R/W">
            <bitenum id="UART" value="0x0" description="Default functionality is UART"/>
            <bitenum id="SPI" value="0x1" description="SPG in SPI Mode"/>
            <bitenum id="I2C_CONTROLLER" value="0x2" description="SPG in I2C Controller Mode"/>
            <bitenum id="I2C_PERIPHERAL" value="0x3" description="SPG in I2C Peripheral Mode"/>
        </bitfield>
    </register>
    <group id="SPGSS2_EXT_GPRCM_UC1_GPRCM" name="SPGSS2_EXT_GPRCM_UC1_GPRCM" instances="1" offset="0x82800" instaddr="0x100" description="">
        <register id="SPGSS2_EXT_GPRCM_UC1_PWREN" width="32" offset="0x0" description="Power enable">
            <bitfield id="ENABLE" description="Enable the power" begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="DISABLE" value="0x0" description="Disable Power"/>
                <bitenum id="ENABLE" value="0x1" description="Enable Power"/>
            </bitfield>
        </register>
        <register id="SPGSS2_EXT_GPRCM_UC1_RSTCTL" width="32" offset="0x4" description="Reset Control">
            <bitfield id="RESETSTKYCLR" description="Clear the RESETSTKY bit in the STAT register" begin="1" end="1" width="1" rwaccess="R/W">
                <bitenum id="NOP" value="0x0" description="Writing 0 has no effect"/>
                <bitenum id="CLR" value="0x1" description="Clear reset sticky bit"/>
            </bitfield>
            <bitfield id="RESETASSERT" description="Assert reset to the peripheral" begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="NOP" value="0x0" description="Writing 0 has no effect"/>
                <bitenum id="ASSERT" value="0x1" description="Assert reset"/>
            </bitfield>
        </register>
        <register id="SPGSS2_EXT_GPRCM_UC1_CLKCFG" width="32" offset="0x8" description="Peripheral Clock Configuration Register">
            <bitfield id="BLOCKASYNC" description="Async Clock Request is blocked from starting SYSOSC or forcing bus clock to 32MHz" begin="8" end="8" width="1" rwaccess="R/W">
                <bitenum id="DISABLE" value="0x0" description="Not block async clock request"/>
                <bitenum id="ENABLE" value="0x1" description="Block async clock request"/>
            </bitfield>
        </register>
        <register id="SPGSS2_EXT_GPRCM_UC1_GPRCM_STAT" width="32" offset="0x14" description="Status Register">
            <bitfield id="RESETSTKY" description="This bit indicates, if the peripheral was reset, since this bit was cleared by RESETSTKYCLR in the RSTCTL register" begin="16" end="16" width="1" rwaccess="R">
                <bitenum id="NORES" value="0x0" description="The peripheral has not been reset since this bit was last cleared by RESETSTKYCLR in the RSTCTL register"/>
                <bitenum id="RESET" value="0x1" description="The peripheral was reset since the last bit clear"/>
            </bitfield>
        </register>
